lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    p2p_routeur_app.c
 * @author  MCD Application Team
 * @brief   P2P Routeur Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "app_ble.h"
#include "p2p_routeur_app.h"
#include "stm32_seq.h"
#include "data_management.h"
#include "timer.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

typedef struct
{
  /**
   * state of the P2P Client
   * state machine
   */
  APP_BLE_ConnStatus_t state;

  /**
   * connection handle
   */
  uint16_t connHandle;

  /**
   * handle of the P2P service
   */
  uint16_t P2PServiceHandle;

  /**
   * end handle of the P2P service
   */
  uint16_t P2PServiceEndHandle;

  /**
   * handle of the Tx characteristic - Write To Server
   *
   */
  uint16_t P2PWriteToServerCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */
  uint16_t P2PWriteToServerDescHandle;

  /**
   * handle of the Rx characteristic - Notification From Server
   *
   */
  uint16_t P2PNotificationCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Rx characteristic
   */
  uint16_t P2PNotificationDescHandle;

  /**
   * handle of the Rx characteristic - Notification From Server
   *
   */
  uint16_t P2PReadCharHdle;

  uint16_t P2PcurrentCharBeingRead;

  P2P_Client_Opcode_Notification_evt_t sensor_evt_type;

}P2P_ClientContext_t;

/* USER CODE BEGIN PTD */


typedef struct{
	uint8_t Value;
	uint8_t CurrentPosition;
}Gestion_Conn_NbrSensor_t;


typedef struct{
	Pairing_request_status status;
	char SensorName[19];
}Gestion_Conn_PairingRequest_t;

typedef struct{
	char SensorName[19];
	uint8_t dataType;
}Gestion_Conn_Datatype_t;

typedef struct
{
	P2P_Router_Notification_evt_t state;

	Gestion_Conn_NbrSensor_t 		NumberOfSensorNearbyStruct;
	Gestion_Conn_PairingRequest_t	PairingRequestStruct;
	Gestion_Conn_Datatype_t			SensorDataTypeStruct;

    uint8_t Update_timer_Id_CONN_HAND_CARA_2;
    uint8_t Update_timer_Id_CONN_HAND_CARA_4;
   

} P2P_Router_App_Context_t;



/* Private defines ------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

#define MAX_NAMES							8
#define MAX_CARAC							19


#define NAME_CHANGES_PERIODE			(0.1*1000*1000/CFG_TS_TICK_VAL) //100ms//

int sensorIndexForServices = 0;
bool isFirstTimerInit = true;
/* USER CODE BEGIN PD */

extern ScannedDevicesPackage_t scannedDevicesPackage;
extern UsedDeviceInformations_t usedDeviceInformations[4];
Data_per_service_t Data_per_service;


/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_ClientContext_t aP2PClientContext[BLE_CFG_CLT_MAX_NBR_CB];

/**
 * END of Section BLE_APP_CONTEXT
 */
/* USER CODE BEGIN PV */
PLACE_IN_SECTION("BLE_APP_CONTEXT") static P2P_Router_App_Context_t P2P_Router_App_Context;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

static SVCCTL_EvtAckStatus_t Client_Event_Handler(void *pckt);
static void Server_Update_Service( void );
static void Client_Update_Service( void );
void P2P_Router_APP_Init(void);
void P2P_Client_App_Notification(P2P_Client_App_Notification_evt_t *pNotification);
void P2P_Client_Init(void);

int getCorrespondingIndex(char* sensorName);
static void Update_Paired_Devices_In_Flash(void);
/* USER CODE BEGIN PFP */


static void P2P_SensorDataType_Timer_Callback(void){
	UTIL_SEQ_SetTask(1<<CFG_TASK_SEND_DATA_TYPE_ID, CFG_SCH_PRIO_0 );
}

static void P2P_SensorName_Timer_Callback(void){
	UTIL_SEQ_SetTask(1<<CFG_TASK_SEND_SENSOR_NAMES_ID, CFG_SCH_PRIO_0 );
}


static void Update_Paired_Devices_In_Flash(void){
    struct settings readSettings;
    struct settings settingsToWrite;

    int indexOfDeviceList = 0;
    indexOfDeviceList = getCorrespondingIndex(P2P_Router_App_Context.PairingRequestStruct.SensorName);

    int sum = 0;
    int index = 0;

    readFlash((uint8_t*)&readSettings);
    settingsToWrite = readSettings;
    if(P2P_Router_App_Context.PairingRequestStruct.status == CONNECTING){
    	for(int i = 0; i < sizeof(settingsToWrite.sensors); i++){
    		sum = 0;
    		for(int k = 0; k < sizeof(settingsToWrite.sensors[i].name);k++){
    			sum |= settingsToWrite.sensors[i].name[k];
    		}
    		if(sum == 0){ //space is empty
    			strcpy(settingsToWrite.sensors[i].name, P2P_Router_App_Context.PairingRequestStruct.SensorName);
    			memcpy(settingsToWrite.sensors[i].macAddress, scannedDevicesPackage.scannedDevicesList[indexOfDeviceList].macAddress, sizeof(settingsToWrite.sensors[i].macAddress));
    			index = i;
    			break;
    		}
    	}
    }
    else{ // request to disconnect
        for(int i = 0; i < sizeof(readSettings.sensors); i++){
        	if(strcmp(P2P_Router_App_Context.PairingRequestStruct.SensorName, settingsToWrite.sensors[i].name) == 0){
        		memset(settingsToWrite.sensors[i].name, 0, sizeof(settingsToWrite.sensors[i].name));
        		memset(settingsToWrite.sensors[i].macAddress, 0, sizeof(settingsToWrite.sensors[i].macAddress));

