lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
	//test for seq
	UTIL_SEQ_RegTask(1<<CFG_TASK_UPDATE_FLASH, UTIL_SEQ_RFU, Update_Paired_Devices_In_Flash );

	// for CONNEX_HAND_CARA_2
    UTIL_SEQ_RegTask(1<<CFG_TASK_SEND_SENSOR_NAMES_ID, UTIL_SEQ_RFU, Server_Update_Service );
    HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_2), hw_ts_Repeated, P2P_SensorName_Timer_Callback);

    // for CONNEX_HAND_CARA_4
    UTIL_SEQ_RegTask(1<<CFG_TASK_SEND_DATA_TYPE_ID, UTIL_SEQ_RFU, Server_Update_Service );
    HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(P2P_Router_App_Context.Update_timer_Id_CONN_HAND_CARA_4), hw_ts_Repeated, P2P_SensorDataType_Timer_Callback);

    Data_per_service.isPowerReceived = false;
    Data_per_service.isCSCReceived = false;
    Data_per_service.isShimanoReceived = false;
    /* USER CODE BEGIN P2P_Router_APP_Init_2 */
    /**
     * Initialize LedButton Service
     */

    //tempo
    P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition = 0;

    P2P_Router_App_Context.PairingRequestStruct.status = DISCONNECT;
    for(int i=0; i<(sizeof(P2P_Router_App_Context.PairingRequestStruct.SensorName));i++){
    	P2P_Router_App_Context.PairingRequestStruct.SensorName[i] = 0;
    }


#if (CFG_P2P_DEMO_MULTI != 0 )   

#endif
    /* Update EndDevice Management Service */
    
    

    /* USER CODE END P2P_Router_APP_Init_2 */

    return;
}





/**
 * @brief  Notification from the Server
 * @param  Client Notification from Server side
 * @retval None
 */
void P2P_Client_App_Notification(P2P_Client_App_Notification_evt_t *pNotification)
{
/* USER CODE BEGIN P2P_Client_App_Notification_1 */
	int sensorData[11] = {0};
	int tab[17] = {0};

/* USER CODE END P2P_Client_App_Notification_1 */

    switch(pNotification->P2P_Client_Evt_Opcode)
    {
    /* USER CODE BEGIN P2P_Client_Evt_Opcode */
    case P2P_NOTIFICATION_SHIMANO_RECEIVED_EVT:

    	for(int i = 0; i<pNotification->DataTransfered.Length; i++){
			tab[i] = pNotification->DataTransfered.pPayload[i];
		}
		GetRatio(tab);
		Data_per_service.isShimanoReceived = true;
	break;

    case P2P_NOTIFICATION_CSC_RECEIVED_EVT:

    	for(int i = 0; i<pNotification->DataTransfered.Length; i++){
			sensorData[i] = pNotification->DataTransfered.pPayload[i];
		}

		switchCase(sensorData);
		Data_per_service.isCSCReceived = true;
	break;

    case P2P_NOTIFICATION_CP_RECEIVED_EVT:
    	for(int i = 0; i<2; i++){
			sensorData[i] = pNotification->DataTransfered.pPayload[i+1];
		}

    	powerFunction(sensorData);
    	Data_per_service.isPowerReceived = true;

    break;
    /* USER CODE END P2P_Client_Evt_Opcode */
        default:
    /* USER CODE BEGIN P2P_Client_Evt_Opcode_default */

    /* USER CODE END P2P_Client_Evt_Opcode_default */
        break;

    }
/* USER CODE BEGIN P2P_Client_App_Notification_2 */
    if(Data_per_service.isShimanoReceived && Data_per_service.isCSCReceived && Data_per_service.isPowerReceived && isFirstTimerInit){
        startAlgoTimer();
        isFirstTimerInit = false;
    }

/* USER CODE END P2P_Client_App_Notification_2 */
    return;
}

/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void P2P_Client_Init(void)
{
    uint8_t index =0;
/* USER CODE BEGIN P2P_Client_Init_1 */
    UTIL_SEQ_RegTask( 1<< CFG_TASK_SEARCH_SERVICE_ID, UTIL_SEQ_RFU, Client_Update_Service );

/* USER CODE END P2P_Client_Init_1 */

    for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
        aP2PClientContext[index].state= APP_BLE_IDLE;
    /**
     *    Register the event handler to the BLE controller
     */
    SVCCTL_RegisterCltHandler(Client_Event_Handler);
/* USER CODE BEGIN P2P_Client_Init_2 */
    APP_DBG_MSG("-- LED BUTTON CLIENT INITIALIZED \n");
/* USER CODE END P2P_Client_Init_2 */
    return;
}

/* USER CODE BEGIN FD */
int getCorrespondingIndex(char* sensorName){
	for(int i = 0; i<scannedDevicesPackage.numberOfScannedDevices;i++){
		if(strcmp(sensorName, scannedDevicesPackage.scannedDevicesList[i].deviceName) == 0){
			return i;
		}
	}
	return -1;
}
/* USER CODE END FD */
/*************************************************************
 *
 * PUBLIC FUNCTIONS
 *
 *************************************************************/
void P2PR_APP_Init( void )
{
    P2P_Router_APP_Init();
    P2P_Client_Init();
    /* USER CODE BEGIN P2PR_APP_Init */

    /* USER CODE END P2PR_APP_Init */
    return;
}

/* USER CODE BEGIN FD_PUBLIC_FUNCTIONS */

/* USER CODE END FD_PUBLIC_FUNCTIONS */
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Server_Update_Service( void )
{
	switch(P2P_Router_App_Context.state){
		case EDS_CONNEX_HAND_CARA_2:
		{
		    /* USER CODE BEGIN Server_Update_Service */

			uint8_t value[20];
			uint8_t index =  P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition;

			Pairing_request_status status = DISCONNECT;

			switch(scannedDevicesPackage.scannedDevicesList[index].pairingStatus){
				case APP_BLE_LP_CONNECTING:
					status = CONNECTING;
					break;
				case APP_BLE_CONNECTED_CLIENT:
					status = CONNECT;
					break;
				case APP_BLE_IDLE:
					status = DISCONNECT;
					break;
				default:
					break;
			}

			value[0] = (uint8_t)((scannedDevicesPackage.scannedDevicesList[index].position) << 2) + status; // PPPP PPCC

		    //green led is on when notifying
		    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);

			printf("Size: %d \n\r",sizeof(scannedDevicesPackage.scannedDevicesList[index].deviceName));
			printf("Position: %d \n\r",scannedDevicesPackage.scannedDevicesList[index].position);
			printf("[");

			printf("%x,",value[0]);

			for(int i = 1; i<(sizeof(value));i++){
				value[i] = (uint8_t)(scannedDevicesPackage.scannedDevicesList[index].deviceName[i-1]);
				printf("%x,",value[i]);
			}

			P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition ++;

			if (P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition >= scannedDevicesPackage.numberOfScannedDevices){
				P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition = 0;
			}

			printf("]\n\r");

